# Завдання 1
# Створіть список кольорів [“black”, “yellow”, “blue”]
# - Виведіть усі кольори
# - Виведіть кольори які починаються на b
# - Виведіть кольори де більше 5-ти літер
# - Добавте кольори red, green, purple
# - Зробіть усі слова в списку upper
# - Видаліть blue
# - Відсортуйте список в алфавітному порядку
# - У списку що вийшов виведіть елементи у форматі:
# 1. колір
# 2. колір
# …

# Створення списку кольорів
colors = ["black", "yellow", "blue"]

# a. Вивід усіх кольорів
print("a.", colors)

# b. Кольори, які починаються на 'b'
for color in colors:
    if color.startswith("b"):
        print("b.", color)

# c. Кольори, де більше 5-ти літер
for color in colors:
    if len(color) > 5:
        print("c.", color)

# d. Додаємо кольори
colors.append("red")
colors.append("green")
colors.append("purple")
print("d.", colors)

# e. Змінюємо всі кольори на великі літери
for i in range(len(colors)):
    colors[i] = colors[i].upper()
print("e.", colors)

# f. Видаляємо BLUE
if "BLUE" in colors:
    colors.remove("BLUE")
print("f.", colors)

# g. Сортування за алфавітом
colors.sort()
print("g.", colors)

# h. Вивід у форматі: 1. КОЛІР
print("h.")
for i in range(len(colors)):
    print(f"{i+1}. {colors[i]}")



# Завдання 2
# Користувач вводить слова через пропуск. Потрібно до
# кожного слова добавити ** на початку та в кінці і вивести
# результат через кому.
# Приклад: **яблуко**, **груша**, **персик**

# Введення слів від користувача
words = input("Введіть слова через пробіл: ").split()

# додаємо **
for i in range(len(words)):
    words[i] = f"**{words[i]}**"

# Об’єднуємо слова в рядок через кому
text = ", ".join(words)

# Виводимо результат
print(text)


# Використовуй материал лекции.
# Завдання 3.
# a. товари – ["хліб", "молоко", "сир", "яблука", "кава"]
# b. ціни – [20.5, 28.0, 120.0, 45.3, 89.9]
# Користувач вводить назву товару, якщо такого товару
# немає, повідомити про це.
# Якщо товари є, то отримати його індекс та вивести
# відповідну ціну.

# Списки товарів та цін
products = ["хліб", "молоко", "сир", "яблука", "кава"]
prices = [20.5, 28.0, 120.0, 45.3, 89.9]

# Введення товару користувачем
product = input("Введіть назву товару: ").strip().lower()

# Перевірка наявності товару в списку
if product in products:
    index = products.index(product)
    price = prices[index]
    print(f"Ціна на {product} — {price} грн")
else:
    print("Такого товару немає в списку.")

