# Завдання 1
# Користувач вводить слова через пропуск а також
# число N. Відсортуйте ці слова в алфавітному порядку та
# виведіть перші N слів з відсортованого списку

# Введення слів через пропуск
words = input("Введіть слова через пробіл: ").split()

# Введення числа N
n_input = input("Введіть число N: ").strip()

# Перевірка чи число дійсно ціле позитивне
if n_input.isdigit():
    n = int(n_input)
    words.sort()  # Сортування в алфавітному порядку
    print("Перші", n, "слів:", words[:n])
else:
    print("Невірне значення для N.")

# Завдання 2
# Користувач вводить слова через пропуск. Добавте до
# кожного слова @gmail.com та виведіть новий список слів

# Введення слів через пробіл
words = input("Введіть слова через пробіл: ").split()

# Додавання до кожного слова "@gmail.com"
emails = []
for word in words:
    emails.append(word + "@gmail.com")

# Виведення нового списку
print("Новий список:")
print(emails)


# Завдання 3
# Проводиться опитування. Користувачі можуть дати 5
# варіантів відповіді:
#  негативно
#  скоріше негативно
#  нейтрально
#  скоріше позитивно
#  позитивно
# Створіть 2 списки: з варіантами відповідями та
# кількостями відповідей на кожен варіант.
# Користувач вводить варіанти відповідей, поки не введе
# END
# Після чого виведіть статистику скільки людей як саме
# відповіли у форматі:
# 10 – негативно
# 27 – скоріше негативно
# …

# Список варіантів відповідей
answers = ['негативно', 'скоріше негативно', 'нейтрально', 'скоріше позитивно', 'позитивно']

# Кількість голосів для кожного варіанта
counts = [0, 0, 0, 0, 0]

# Інструкція для користувача
print("Варіанти відповіді:")
for a in answers:
    print(f"- {a}")
print("Введіть 'END', щоб завершити опитування.")

# Ввід користувачів
while True:
    user_input = input("Ваша відповідь: ").strip().lower()
    if user_input == "end":
        break

    if user_input in answers:
        index = answers.index(user_input)
        counts[index] += 1
    else:
        print("Неправильна відповідь. Спробуйте ще раз.")

# Вивід статистики
print("\nСтатистика відповідей:")
for i in range(len(answers)):
    print(f"{counts[i]} – {answers[i]}")
