# # Завдання 1
# # Є список з товарами. Користувач вводить індекс товару,
# # який треба вивести. Обробіть виняток
# items = ['молоко','яблука','банани']
#
# try:
#     user_index = int(input('введіть індекс товару: '))
#     if user_index < 0:
#         print('індекс не може бути відємним')
#     else:
#         print(items[user_index])
# except ValueError:
#     print('помилка - портрібна цифа')
# except IndexError:
#     print(f'помилка - введіть будьласка вірний індекс, індекс має бути в діапозоні 0 - {len(items) - 1}')

# Завдання 2
# Напишіть функцію, яка запитує користувача вік та
# повертає його. Якщо вік неправильний(<0 або >130)
# викликати виняток ValueError.
# Написати код try … except який використовує дану
# функцію.

def get_user_age():
    try:
        user_age = int(input('введіть свій вік'))

    except ValueError:
        raise ValueError('помилка - портрібна цифа')

    if user_age < 0 or user_age > 130:
        raise ValueError('помилка - вкажіть коректний вік')

    return user_age


try:
    res = get_user_age()
    print(f'ващ вік {res}')
except Exception as err:
    print(err)


# Завдання 3 Напишіть функцію, яка запитує користувача номер телефону та повертає його.
# Якщо номер не вірний, тобто не починається з +038 або в ньому не 11 символів то
# викликати виняток ValueError. Написати код try … except який використовує дану функцію.

def get_phone():
    phone = input("Введіть номер телефону у форматі +380ХХХХХХХХХХ: ")
    if len(phone) != 14:
        raise ValueError(" Номер телефону має містити 14 символів")

    if not phone.startswith('+038'):
        raise ValueError("Номер телефону має почінатися з +038")

    if not phone[1:].isdigit():
        raise ValueError("Номер телефон містить не цифри")

    return phone


try:
    phone_number = get_phone()
    print(f"Ваш номер телефону: {phone_number}")
except ValueError as err:
    print(f"Помилка: {err}")

# Завдання 4
# Організуйте фільтр товарів в онлайн магазині. Усі товари діляться на певні категорії, причому один і той самий товар
# може відноситись до різних категорій. Є словник, де ключі – назви категорій, а значення – множини з товарами цієї
# категорії. Користувач вводить 2 категорії, виведіть ті товари, які відносяться одночасно до цих двох категорій.
# Обробіть виняток коли категорії немає в словнику.

categories = {
    "Овочі": {"помідори", "огірки", "капуста", "морква"},
    "Фрукти": {"яблука", "банани", "виноград", "груші"},
    "Салати": {"помідори", "огірки", "салат", "рукола"},
    "Напої": {"сік", "вода", "чай"},
}
try:
    cat1 = input("Введіть першу категорію")
    cat2 = input("Введіть другу категорію")

    cat_intersect = categories[cat1] & categories[cat2]

    if cat_intersect:
        print(cat_intersect)
    else:
        print("Немає спільних товарів")

except KeyError as err:
    print(f"Немає такої категорії: {err}")


# Завдання 5
# Організуйте базу даних «Співробітники». Усі дані мають
# зберігатись у словнику де ключ – ім’я людини, значення –
# зарплата. Реалізуйте такий функціонал(через функції):
#  Вивести дані на екран
#  Добавити співробітника
#  Видалити співробітника
#  Показати зарплату співробітника
#  Змінити зарплату співробітнику
# У випадку некоректних даних функції повинні викликати
# винятки з описом помилки






























