# Завдання 1
# Користувач вводить з клавіатури три числа.
# Необхідно знайти суму чисел, добуток чисел.
# Результат обчислень вивести на екран.

# Введення чисел
num1 = input("Введіть перше число ")
num2 = input("Введіть друге число ")
num3 = input("Введіть третє число ")

# Зміна типу даних на int
num1_int = int(num1)
num2_int = int(num2)
num3_int = int(num3)

# Обчислення суми чисел та множення
sum = num1_int + num2_int + num3_int
dob = num1_int * num2_int * num3_int

# Виведення результатів на екран
print(f"Сума трьох чисел: {sum}")
print(f"Добуток чисел: {dob}")


# Завдання 2
# Напишіть програму, що обчислює площу ромба.
# Користувач з клавіатури вводить довжину двох його діагоналей.
# Площа ромба - половина добутку діагоналей. A = 1/2 * a1 *a2

# Введення довжин двох діагоналей ромба
a1 = input("Введіть першу діагональ ")
a2 = input("Введіть другу діагональ ")

# Зміна типу даних на float() або на int()
a1 = float(a1)
a2 = float(a2)

# Обчислення площі ромба A = 1/2 * a1 *a2
A = 0.5 * a1 *a2

# Виведення результату
print(f"Площа ромба з діагоналями a1 = {a1} і a2 = {a2} дорівнює {A}")


# Завдання 3
# Користувач вводить з клавіатури три числа:
# 1. Зарплата за місяць
# 2. Сума місячного платежу за кредитом у банку
# 3. Заборгованість за комунальні послуги
# Необхідно вивести на екран суму, яка залишиться у користувача після всіх виплат.

# Введення даних користувачем
groschi = input("Введіть зарплату за місяць: ")
bank = input("Введіть суму місячного платежу за кредитом: ")
hata = input("Введіть заборгованість за комунальні послуги: ")

# Зміна типу даних на float() або на int()
groschi = float(groschi)
bank = float(bank)
hata = float(hata)

# Обчислення залишку після всіх виплат
vytraty = bank + hata
zalyshok = groschi - vytraty

# Виведення результату
print(f"Зарплата: {groschi}")
print(f"Платіж за кредитом: {bank}")
print(f"Комунальні послуги: {hata}")
print(f"Загальні витрати: {vytraty}")
print(f"Залишок після всіх виплат: {zalyshok}")
print("Живи ощадливо або заробляй більше!")


# Завдання 4
# Напишіть програму, яка обчислює вартість поїздки на автомобілі.
# Користувач вводить:
# 1. Відстань у кілометрах
# 2. Витрата палива на 100 кілометрів
# 3. Ціну за літр бензину
# Програма повинна вивести підсумкову вартість поїздки.

# Отримання даних
dist = input("Введіть відстань поїздки (км): ")
fuel_cons = input("Введіть витрату палива на 100 км (л/100км): ")
fuel_price = input("Введіть ціну за літр бензину: ")

# Зміна типу даних на float() або на int()
dist = float(dist)
cons = float(fuel_cons)
price = float(fuel_price)

# Обчислення кількості необхідного палива
total_fuel = (dist * cons) / 100

# Обчислення вартості поїздки
trip_cost = total_fuel * price

# Виведення результатів
print("Розрахунок вартості поїздки:")
print(f"Відстань: {dist} км")
print(f"Витрата палива: {cons} л/100км")
print(f"Ціна палива: {price} за літр")
print(f"Необхідна кількість палива: {total_fuel:} л")
print(f"Загальна вартість поїздки: {trip_cost:}")


# Завдання 5
# Користувач вводить загальну суму рахунку в ресторані та кількість осіб, які будуть ділити рахунок.
# Напишіть програму, яка розраховує суму чайових (15% від загальної суми) і загальну суму, включаючи чайові.
# Потім програма повинна розділити загальну суму з чайовими на кількість осіб і вивести, скільки кожна людина має заплатити.

# Отримання введених користувачем даних
total_sum = input("Введіть загальну суму рахунку: ")
num_people = input("Введіть кількість осіб: ")

# Зміна типу даних на float() або на int()
total_sum = float(total_sum)
num_people = int(num_people)

# Розрахунок чайових (15% від суми)
chayovi = total_sum * 0.15

# Розрахунок загальної суми з чайовими
total_plus_chayovi = total_sum + chayovi

# Розрахунок на одну особу
na_personu = total_plus_chayovi / num_people

# Виведення результатів
print(f"Розрахунок рахунку:")
print(f"Сума рахунку: {total_sum:}")
print(f"Сума чайових (15%): {chayovi:}")
print(f"Загальна сума з чайовими: {total_plus_chayovi:}")
print(f"Кількість осіб: {num_people}")
print(f"Сума до сплати з кожної особи: {na_personu:}")
