# Завдання 1
# Користувач вводить з клавіатури два числа.
# Необхідно знайти суму чисел, різницю чисел, добуток чисел.
# Результат обчислень вивести на екран.

# Отримання введених користувачем чисел
num1 = input("Введіть число ")
num2 = input("Введіть число ")

#зміна типу данних на int
x = int(num1)
y = int(num2)

# Обчислення суми, різниці та добутку
suma = x + y
minus = x - y
multi = x * y

# Виведення результатів на екран
print(f"Сума чисел: {suma}")
print(f"Різниця чисел: {minus}")
print(f"Добуток чисел: {multi}")


# Завдання 2
# Користувач вводить із клавіатури два числа.
# Перше число — це значення, друге число — відсоток, який необхідно порахувати.
# Наприклад, ми ввели з клавіатури 50 і 10. Потрібно вивести на екран 10 відсотків від 50.

# Отримання введених користувачем чисел
number = (input("Введіть значення: "))
percent = (input("Введіть відсоток: "))

#зміна типу данних на int
x = int(number)
y = int(percent)

# Обчислення відсотка від значення
result = (x * y) / 100

# Виведення результату на екран
print(f"{y}% від {x} = {result}")


# Завдання 3
# Програма для обчислення площі прямокутника
# Користувач з клавіатури вводить ширину і висоту прямокутника

# Користувач вводить ширину ш висоту прямокутника
width = (input("Введіть ширину прямокутника: "))
height = (input("Введіть висоту прямокутника: "))

#зміна типу данних на int
width = int(width)
height = int(height)

# Обчислення площі прямокутника
perimeter = width * height

# Виведення результату
print(f"Площа прямокутника шириною {width} і висотою {height} дорівнює {perimeter}")


# Завдання 4
# Програма для обчислення периметру квадрата
# Користувач вводить з клавіатури довжину сторони квадрата

# Отримання введеної користувачем довжини сторони квадрата
side_dovzhina = (input("Введіть довжину сторони квадрата: "))

#зміна типу данних на int
side_dovzhina = int(side_dovzhina)

# Обчислення периметру квадрата за формулою P = 4 * a
perimeter = 4 * side_dovzhina

# Виведення результату на екран
print(f"Периметр квадрата зі стороною {side_dovzhina} дорівнює {perimeter}")


# Завдання 5
# Програма для перетворення довжини з метрів у сантиметри

# Нагадування що 1 метр = 100 сантиметрів
print("Нагадую, що 1 метр = 100 сантиметрів")

# Отримання значення довжини в метрах від користувача
dovzhina_meters = (input("Введіть довжину в метрах: "))

#зміна типу данних на int
dovzhina_meters = int(dovzhina_meters)

# Перетворення метрів у сантиметри
dovzhina_centimeters = dovzhina_meters * 100

# Виведення результату на екран
print(f"{dovzhina_meters} м = {dovzhina_centimeters} см")
