# Користувач вводить ціну однієї кружки
# та їхню кількість
# Виведіть ціну покупки

# # введення даних
# price_cup = input("Введіть ціну однієї кружки: ")
# count_cup = input("Введіть кількість кружок: ")
#
# price_cup = float(price_cup)  # ціна може бути дробова(напр 35.50)
# count_cup = int(count_cup)
#
# # основна програма
# total = count_cup * price_cup
#
# # виведення результатів
# print(f"Ціна покупки {total}грн")
#
# # інший спосіб
# print(f"Ціна покупки {count_cup * price_cup}грн")
#
#
# # та сама програма, тільки по іншому
# a = input("Введіть ціну однієї кружки: ")
# b = input("Введіть кількість кружок: ")
#
# c = float(a)
# d = int(b)
#
# f = c*d
#
# print(f"Ціна покупки {f}грн")

# функції

# min -- функція яка рахує мінімальне число
# round -- функція, яка округлює дрове число
# print -- функція, яка виводить результат на екран

# знайти найменше серед чисел 4, 2, 7
# Результат: 2
# min_num = min(4, 2, 7)
#
# # округлити число 12.37
# # Результат: 12
# res = round(12.37)
#
# # вивести на екран 'apple' 'banana' 'pear'
# #
# print('apple', 'banana', 'pear')

# Знайти найбільше серед чисел 1, 2, 10, 7
# Функція: max

# Щоб спекти один пиріг потрібно 4 яблука
# Користувач вводить кількість яблук
# Виведіть, скільки пирогів він може спекти
# Виведіть скільки яблук залишиться

# apple_count = input("Введіть кількість яблук: ")
# apple_count = int(apple_count)
#
# apples_per_pie = 4
#
# pie_count = apple_count // apples_per_pie  # ділимо націло
# unused_apples = apple_count % apples_per_pie  # остача(залишок)
#
# print(f"Ви можете спекти {pie_count} пирогів")
# print(f"Залишиться {unused_apples} яблук")



# Програма отримує кількість балів, які отримав учень
# за тест, а також максимальну можливу кількість балів
# Виведіть відсоток правильних відповідей
# Наприклад, учень отримав 35 з 40 балів, це 87.5%

student_score = int(input('Введіть оцінку учня: '))
max_score = int(input('Введіть максимальну оцінку: '))

percent = student_score / max_score * 100

# звичайний варіант
print(f"Відсоток правильних відповідей -- {percent}%")

# 1 знак після коми
print(f"Відсоток правильних відповідей -- {percent:.1f}%")

# функція round
print(round(percent, 1))