# цикл while

# for num in range(1, 10):
#     if num % 3 == 0:
#         continue
#
#     print(num)


# користувач має ввести кількість товару
# кількість товару має бути додатньою

# item_count = -1
#
# # поки кількість товару неправильна, продовжуємо запитувати користувача
# while item_count < 0:
#     item_count = int(input("Введіть кількість товару: "))
#
#
# print(f"Ви ввели число {item_count}")


# користувач має ввести кількість товару
# кількість товару має бути додатньою
# спосіб 2

# while True:  # вічний цикл
#     item_count = int(input("Введіть кількість товару: "))
#
#     # умова зупинки(користувач ввів щось хороше)
#     if item_count >= 0:
#         break
#
#     # може бути багато break
#     if item_count == -10:
#         break
#
#
# print(f"Ви ввели число {item_count}")

# користувач вводить рік. Програма пропонує дві дії:
# 1. Порахувати скільки людині років яка народилась в цей рік
# 2. В якому році людині буде 65 років
# 3. Зупинка програми\вихід з програми

while True:
    # показуємо інструкцію
    print("Інструкція")
    print("1. Порахувати скільки людині років яка народилась в цей рік")
    print("2. В якому році людині буде 65 років")
    print("3. Зупинка програми\вихід з програми")

    # запитуємо в користувач що він хоче
    choice = int(input("Вкажіть свій вибір: "))

    # обробляємо вибір користувача
    if choice == 1:
        # запитуємо дані у користувача
        year = int(input("Введіть рік: "))

        # перевірка чи рік не правильний
        if year < 0:
            print("Рік не може бути від'ємним")
            continue  # запустити цикл заново

        if year > 2025:
            print("Рік надто великий")
            continue

        age = 2025 - year
        print(f"Вам {age} років")

    elif choice == 2:
        # запитуємо дані у користувача
        year = int(input("Введіть рік: "))

        # перевірка чи рік не правильний
        if year < 0:
            print("Рік не може бути від'ємним")
            continue  # запустити цикл заново

        if year > 2025:
            print("Рік надто великий")
            continue

        retired_year = year + 65
        print(f"Ви вийдете на пенсію у {retired_year} році")

    elif choice == 3:
        break

    else:
        print("Невірна команда, оберіть число з 1-3")



