# Завдання 1
# Користувач вводить оцінку за іспит(від 1 до 5) поки не
# введе правильне число. Після цього виведіть цю оцінку
# текстом
# 1. Дуже погано
# 2. Погано
# 3. Задовільно
# 4. Добре
# 5. Чудово

while True:
    mark = int(input("Введіть оцінку (1-5): "))
    if mark >= 1 and mark <= 5:
        break

if mark == 1:
    print("Дуже погано")
elif mark == 2:
    print("Погано")
elif mark == 3:
    print("Задовільно")
elif mark == 4:
    print("Добре")
elif mark == 5:
    print("Чудово")


# Завдання 2
# Проводиться опитування «Чи потрібно будувати більше
# дитячих садків у вашому місті?»
# Напишіть програму для підрахунку відповідей.
# Користувач вводить слова «так» або «ні» поки не введе слово
# «стоп», після чого треба показати кількості «так» та «ні» і
# також яких голосів більше.
# Якщо введено невідоме слово, то вивести повідомлення
# про помилку та продовжити підрахунок

yes = 0
no = 0

while True:
    answer = input("Ваш голос (так / ні / стоп): ")

    if answer == "стоп":
        break
    elif answer == "так":
        yes += 1
    elif answer == "ні":
        no += 1
    else:
        print("Невідома відповідь. Введіть 'так', 'ні' або 'стоп'.")

print("Кількість 'так':", yes)
print("Кількість 'ні':", no)

if yes > no:
    print("Більше голосів 'так'")
elif no > yes:
    print("Більше голосів 'ні'")
else:
    print("Голосів 'так' і 'ні' порівну")
