# Завдання 1
# Користувач вводить колір світлофора. Виведіть одну з дій:
# 1. Зелений – їхати
# 2. Жовтий – приготуватись
# 3. Червоний – стоп

color = input("Введіть колір світлофора (Зелений, Жовтий, Червоний): ")

if color == "Зелений":
    print("Їхати")
elif color == "Жовтий":
    print("Приготуватись")
elif color == "Червоний":
    print("Стоп")
else:
    print("Невідомий колір")


# Завдання 2
# Користувач вводить розмір футболки(S, M, L або XL).
# 1. Якщо введено S або M – спитайте колір футболки (немає фіолетових та жовтих)
# 2. Якщо введено L – повідомте що всі футболки цього розміру закінчились
# 3. Якщо введено XL – спитайте тип тканини (є лише бавовна)
# В результаті програма повинна вивести «Є в наявності» або «Немає в наявності»

rozmir = input("Введіть розмір футболки (S, M, L, XL): ")

if rozmir == "S" or rozmir == "M":
    kolir = input("Введіть колір футболки (Фіолетовий, Жовтий і т.д.): ")
    if kolir == "Фіолетовий" or kolir == "Жовтий":
        print("Немає в наявності")
    else:
        print("Є в наявності")

elif rozmir == "L":
    print("Немає в наявності")

elif rozmir == "XL":
    tkanina = input("Введіть тип тканини (Бавовна, Поліестер, Льон, Віскоза і т.п.): ")
    if tkanina == "Бавовна":
        print("Є в наявності")
    else:
        print("Немає в наявності")

else:
    print("Невідомий розмір")


# Завдання 3
# Користувач вводить свій дохід, наявність судимостей (так або ні) та вік.
# Якщо дохід більше 20 000 грн,
# немає судимостей та
# користувач старший 21 року
# – виведіть фразу, що можна отримати кредит, інакше що не можна.

dohid = int(input("Введіть дохід (грн): "))
sudimist = input("Чи є судимості? (так/ні): ")
vik = int(input("Введіть вік: "))

if dohid > 20000 and sudimist == "ні" and vik > 21:
    print("Можна отримати кредит")
else:
    print("Кредит отримати не можна")
